tutorials/Xoodles/pitzDaily/constant/turbulenceProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          turbulenceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESmodel        oneEqEddy;

delta           cubeRootVol;

laminarCoeffs
{
}

oneEqEddyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.048;
    ck              ck [0 0 0 0 0 0 0] 0.094;
}

dynOneEqEddyCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.05;
    filter          simple;
}

lowReOneEqEddyCoeffs
{
    ck              ck [0 0 0 0 0 0 0] 0.07;
    ce              ce [0 0 0 0 0 0 0] 1.05;
    beta            beta [0 0 0 0 0 0 0] 0.01;
}

SmagorinskyCoeffs
{
    ck              ck [0 0 0 0 0 0 0] 0.02;
    ce              ce [0 0 0 0 0 0 0] 0.202;
}

DeardorffDiffStressCoeffs
{
    ce              ce [0 0 0 0 0 0 0] 1.048;
    ck              ck [0 0 0 0 0 0 0] 0.094;
    cm              cm [0 0 0 0 0 0 0] 4.13;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

PrandtlCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Cdelta          Cdelta [0 0 0 0 0 0 0] 0.158;
}

vanDriestCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Aplus           Aplus [0 0 0 0 0 0 0] 26;
    Cdelta          Cdelta [0 0 0 0 0 0 0] 0.158;
}

smoothCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    maxDeltaRatio   1.1;
}

kappa           kappa [0 0 0 0 0 0 0] 0.4187;

wallFunctionCoeffs
{
    E               E [0 0 0 0 0 0 0] 9;
}


// ************************************************************************* //
